datasets/hcc/opendj-sdk/queries/long/3503.txt

Found with OpenDJ 4.0.0 rev (1ad3e7a6cb2)

We setup a server and configure dsml.

We then perform a search with an empty base dn:



<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
<batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core"
   requestID="Mandatory attribute [dn] of [searchRequest] element is empty"
   >
<searchRequest
   dn=""
   scope="singleLevel"
   derefAliases="neverDerefAliases">
<filter>
<substrings name="sn"><any>ergin</any></substrings>
</filter>
</searchRequest>
</batchRequest>
</soap-env:Body>
</soap-env:Envelope>



We are expecting:


   <batchResponse xmlns="urn:oasis:names:tc:DSML:2:0:core" requestID="Mandatory attribute [dn] of [searchRequest] element is empty">
      <searchResponse>
        <searchResultDone>
          <resultCode code="0" descr="success"/>
        </searchResultDone>
      </searchResponse>
    </batchResponse>



but we are getting an extra error message in the response:



<searchResponse>
         <searchResultDone>
           <resultCode code="0" descr="success"/>
-          <errorMessage>The search base entry 'dc=com' does not exist</errorMessage>
         </searchResultDone>
       </searchResponse>

